tap 'jesseduffield/lazygit'

# CLI tools
brew 'asdf'                         # runtime version manager driving Node, Ruby, Python via .tool-versions
brew 'atuin'                        # shell history sync and search backed by SQLite
brew 'bash'                         # newer bash than the macOS bundled 3.2, used by scripts requiring associative arrays and modern features
brew 'bat'                          # syntax-highlighted cat replacement, aliased as the default file viewer
brew 'bats-core'                    # bash test framework used by tests/guard-bash.bats
brew 'chafa'                        # terminal image renderer used by fastfetch and similar tools
brew 'cmake'                        # build system required by Neovim plugins with native components
brew 'coreutils'                    # GNU core utilities to override BSD versions on macOS
brew 'ctags'                        # tag generator for code navigation
brew 'difftastic'                   # structural diff tool wired in as GIT_EXTERNAL_DIFF
brew 'dust'                         # disk usage explorer with a tree view
brew 'eza'                          # modern ls replacement with color and git status
brew 'fastfetch'                    # system info display run on terminal launch
brew 'fd'                           # simpler find replacement, used as the file backend by Telescope and fzf
brew 'fzf'                          # fuzzy finder, integrated into shell history and Neovim Telescope
brew 'gh'                           # GitHub CLI for PR, issue, and repo workflows
brew 'git'                          # version control, kept current independent of the Xcode Command Line Tools
brew 'git-delta'                    # diff pager with syntax highlighting, set as core.pager
brew 'gitleaks'                     # secret scanner for git repositories
brew 'gnu-sed'                      # GNU sed for portable script behavior across macOS and Linux
brew 'grep'                         # GNU grep on macOS to match Linux flag behavior
brew 'httpie'                       # human-friendly HTTP client for API testing
brew 'hyperfine'                    # command-line benchmarking tool
brew 'imagemagick'                  # image manipulation library used by Neovim image plugins
brew 'jc'                           # converts CLI output to JSON for piping into jq
brew 'jq'                           # JSON processor for shell pipelines
brew 'lazygit'                      # terminal git UI bound to the lg alias
brew 'less'                         # GNU less from Homebrew, kept current for pager features
brew 'lua'                          # Lua interpreter required by Neovim Lua plugins and luarocks-based dependencies
brew 'luarocks'                     # Lua package manager for Neovim plugins that need extensions
brew 'mkcert'                       # locally trusted dev certificate generator
brew 'ncurses'                      # terminal UI library used by tools like nvim and tmux
brew 'neovim'                       # primary editor, configured under config/nvim
brew 'openssl'                      # TLS toolkit linked against by asdf-built Rubies, Pythons, and other compiled deps
brew 'oxipng'                       # PNG optimizer for assets
brew 'pandoc'                       # document converter for markdown workflows
brew 'pgcli'                        # PostgreSQL CLI with autocompletion and syntax highlighting
brew 'pnpm'                         # fast disk-efficient JavaScript package manager
brew 'postgresql@18'                # local PostgreSQL server for development databases
brew 'procs'                        # modern ps replacement with tree and color output
brew 'reattach-to-user-namespace'   # tmux helper that fixes pasteboard access on macOS
brew 'redis'                        # in-memory data store for local development
brew 'ripgrep'                      # fast recursive grep, default search backend in Neovim and shell
brew 'rust'                         # Rust toolchain required by Neovim plugins with native components (e.g. blink.cmp)
brew 'ssh-copy-id'                  # helper for installing public keys onto remote hosts
brew 'starship'                     # cross-shell prompt configured via config/starship.toml
brew 'tig'                          # terminal git history browser
brew 'tmuxinator'                   # tmux session manager driven by .tmuxinator configs
brew 'tokei'                        # source code line counter by language
brew 'tpm'                          # tmux plugin manager loaded from .tmux.conf
brew 'tree'                         # directory listing tool
brew 'tree-sitter-cli'              # parser CLI used by nvim-treesitter to compile grammars on the main branch
brew 'uv'                           # fast Python package and virtualenv manager
brew 'watchexec'                    # filesystem-driven command runner
brew 'wget'                         # HTTP and FTP downloader for scripts
brew 'yarn'                         # JavaScript package manager for Node projects
brew 'yq'                           # YAML and TOML processor with jq-compatible syntax
brew 'zoxide'                       # directory jumper that learns frequently visited paths
brew 'zsh'                          # modern zsh from Homebrew, set as the login shell
brew 'zsh-autosuggestions'          # inline command suggestions sourced from history
brew 'zsh-completions'              # extra completion definitions loaded by zsh
brew 'zsh-syntax-highlighting'      # live command-line syntax coloring

# GUI apps
cask '1password'                  # password manager desktop app
cask '1password-cli'              # 1Password CLI for shell and SSH agent integration
cask 'adguard'                    # system-wide ad and tracker blocker
cask 'boop'                       # scratchpad for ad-hoc text transformations
cask 'claude'                     # Claude desktop app
cask 'claude-code@latest'         # Claude Code CLI pinned to the latest channel
cask 'cleanshot'                  # screenshot and screen recording tool
cask 'dbeaver-community'          # GUI database client for SQL development
cask 'figma'                      # design tool for UI work
cask 'firefox'                    # secondary browser
cask 'fliqlo'                     # flip clock screensaver
cask 'font-fira-code-nerd-font'   # Nerd Font used by WezTerm and Neovim
cask 'google-chrome'              # primary browser for web development
cask 'neovide-app'                # GUI frontend for Neovim
cask 'onyx'                       # macOS system maintenance utility
cask 'postman'                    # HTTP API client for manual request building
cask 'slack'                      # team chat client
cask 'spotify'                    # music player
cask 'the-unarchiver'             # archive extraction utility
cask 'transmission'               # BitTorrent client
cask 'typora'                     # markdown editor with live preview
cask 'visual-studio-code'         # secondary editor for tasks Neovim is not used for
cask 'vlc'                        # media player
cask 'wezterm'                    # primary terminal emulator, configured under config/wezterm
cask 'zoom'                       # video conferencing client

# Mac App Store
mas '1Password for Safari', id: 1_569_813_296 # 1Password browser extension for Safari
mas 'Affinity Designer 2', id: 1_616_831_348 # vector graphics editor
mas 'Affinity Photo 2', id: 1_616_822_987 # raster image editor
mas 'DuckDuckGo Privacy for Safari', id: 1_482_920_575 # tracker blocker for Safari
mas 'GarageBand', id: 682_658_836 # audio workstation
mas 'JSONPeep', id: 1_458_969_831 # Safari JSON viewer extension
mas 'Keynote', id: 361_285_480 # presentation editor
mas 'Marked 2', id: 890_031_187 # markdown previewer
mas 'Numbers', id: 361_304_891 # spreadsheet editor
mas 'Pages', id: 361_309_726 # document editor
mas 'Speedtest', id: 1_153_157_709 # network speed test utility
mas 'iMovie', id: 408_981_434 # video editor
