tap 'jesseduffield/lazygit'

# CLI tools
brew 'asdf'
brew 'bat'
brew 'chafa'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'fastfetch'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gnu-sed'
brew 'grep'
brew 'imagemagick'
brew 'jq'
brew 'lazygit'
brew 'lua'
brew 'luarocks'
brew 'ncurses'
brew 'neovim'
brew 'openssl'
brew 'pandoc'
brew 'postgresql@18'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rust'
brew 'ssh-copy-id'
brew 'starship'
brew 'tig'
brew 'tmuxinator'
brew 'tpm'
brew 'tree'
brew 'tree-sitter-cli'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# GUI apps
cask '1password'
cask '1password-cli'
cask 'adguard'
cask 'boop'
cask 'claude'
cask 'claude-code@latest'
cask 'cleanshot'
cask 'dbeaver-community'
cask 'figma'
cask 'firefox'
cask 'fliqlo'
cask 'font-fira-code-nerd-font'
cask 'google-chrome'
cask 'neovide-app'
cask 'onyx'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'typora'
cask 'visual-studio-code'
cask 'vlc'
cask 'wezterm'
cask 'zoom'

# Mac App Store
mas '1Password for Safari', id: 1_569_813_296
mas 'Affinity Designer 2', id: 1_616_831_348
mas 'Affinity Photo 2', id: 1_616_822_987
mas 'DuckDuckGo Privacy for Safari', id: 1_482_920_575
mas 'GarageBand', id: 682_658_836
mas 'iMovie', id: 408_981_434
mas 'JSONPeep', id: 1_458_969_831
mas 'Keynote', id: 361_285_480
mas 'Marked 2', id: 890_031_187
mas 'Numbers', id: 361_304_891
mas 'Pages', id: 361_309_726
mas 'Speedtest', id: 1_153_157_709
